org/2022-09-24-fhs-container.org
* build a FHS container

I'm using GNU Guix System on my computer

OpenWRT and Buildroot can't compile use GNU Guix

because they are not considered for non-FHS environments

so I use docker and singularity to make it work

** process

#+BEGIN_SRC shell
  mkdir crosswork
  cd crosswork
  touch Dockerfile
  $EDITOR Dockerfile
  sudo docker build -t crosswork .
  sudo docker run --name crosswork crosswork /bin/sh
  sudo docker export crosswork -o crosswork.tar
  sqfstar crosswork.squashfs < crosswork.tar
  singularity shel -e crosswork.squashfs
  bash
  cd path/to/buildroot/
  make menuconfig
  make
#+END_SRC

