2022-09-24-fhs-container.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Lu Hui" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-orgb31e8bc" class="outline-2">
<h2 id="orgb31e8bc">build a FHS container</h2>
<div class="outline-text-2" id="text-orgb31e8bc">
<p>
I&rsquo;m using GNU Guix System on my computer
</p>

<p>
OpenWRT and Buildroot can&rsquo;t compile use GNU Guix
</p>

<p>
because they are not considered for non-FHS environments
</p>

<p>
so I use docker and singularity to make it work
</p>
</div>

<div id="outline-container-orgcb1db90" class="outline-3">
<h3 id="orgcb1db90">process</h3>
<div class="outline-text-3" id="text-orgcb1db90">
<div class="org-src-container">
<pre class="src src-shell"><code>mkdir crosswork</code>
<code>cd crosswork</code>
<code>touch Dockerfile</code>
<code>$EDITOR Dockerfile</code>
<code>sudo docker build -t crosswork .</code>
<code>sudo docker run --name crosswork crosswork /bin/sh</code>
<code>sudo docker export crosswork -o crosswork.tar</code>
<code>sqfstar crosswork.squashfs &lt; crosswork.tar</code>
<code>singularity shel -e crosswork.squashfs</code>
<code>bash</code>
<code>cd path/to/buildroot/</code>
<code>make menuconfig</code>
<code>make</code>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>Last updated: 2023-04-19</p>
</div>
</body>
</html>